TSD_TK/src/DataProcessors/ПанельМеню/ПанельМеню.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПанельМеню</name>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеТовара2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеЕдиницы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоставщика</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПодтверждено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВведено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продажи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоРасхождение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаРасхождения</name>
      <type>
        <types>EnumRef.ПричиныРасхождения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаРасхожденияСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодХарактеристики</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Весовой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МРЦ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИспМРЦ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаРасхожденияПорядок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СканированиеТовар</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СканированиеЦенник</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПроверена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпецЦена</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеВозврата</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЦенник</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АМ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриемДо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Артикул2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Документы</name>
    <attributes>
      <name>ТипДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументUUID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>55</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтрагентUUID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкладUUID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Инфо</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проведен</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Акт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПринято</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоставщика</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИД</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументЗакрыт</name>
      <comment>0 - новый 1 - закрыт частично 2 - закрыт полностью</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИсполнения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаданиеПроцесса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

TSD_TK/src/DataProcessors/ПанельМеню/ManagerModule.bsl
Функция ПечатьАкта(СутруктураДокумента) Экспорт 
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьОбщийМакет("АктПриема");
	

	Область = Макет.ПолучитьОбласть("Заголовок");
	Область.Параметры.ТекстЗаголовка =  СутруктураДокумента.Заголовок;
	ТабДок.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Поставщик");
	Область.Параметры.ПредставлениеПоставщика =  СутруктураДокумента.Поставщик;
	ТабДок.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Покупатель");
	Область.Параметры.ПредставлениеПокупателя =  СутруктураДокумента.Покупатель;
	ТабДок.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("МестоСоставления");
	Область.Параметры.ПредставлениеСоставления =  СутруктураДокумента.МестоДоставки;
	ТабДок.Вывести(Область);

	Область = Макет.ПолучитьОбласть("Состав");
	ТабДок.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(Область);

	Область = Макет.ПолучитьОбласть("Строка");
	нпп = 1;
	Для Каждого СтрТовар Из СутруктураДокумента.Товары Цикл 
		
		Область.Параметры.нпп = нпп;
		Область.Параметры.Код = СтрТовар.Артикул;
		Область.Параметры.ТоварНаименование = СтрТовар.Наименование;
		Область.Параметры.ЕдиницаИзмерения = СтрТовар.ЕдИзм;
		Область.Параметры.СтавкаНДС = СтрТовар.СтавкаНДС;
		Область.Параметры.ПоНакладной = СтрТовар.ПоНакладной;
		Область.Параметры.ФактическиПринято = СтрТовар.Факт;
		Область.Параметры.ОтклонениеПоНакладной = СтрТовар.Факт-СтрТовар.ПоНакладной;
		Область.Параметры.Причина = СтрТовар.Причина;
		
		
		ТабДок.Вывести(Область);
		
		
		нпп = нпп+1;
	КонецЦикла;
	
	Область = Макет.ПолучитьОбласть("Подвал");
	ТабДок.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Подписи");
	ТабДок.Вывести(Область);


	ТабДок.АвтоМасштаб = Истина;
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	//ТабДок.КоличествоЭкземпляров = 3;

	Возврат ТабДок;
	
КонецФункции

Функция ПечатьРеестрОбщий(тзДокументы)Экспорт
	ТабДок = Новый ТабличныйДокумент;	  
	
	
	таблицаТипДок =	 тзДокументы.Выгрузить(,"ТипДокумента"); 
	таблицаТипДок.Свернуть("ТипДокумента");    
	
	Для Каждого стТипДок  Из таблицаТипДок Цикл     
		
		тзРеестр = тзДокументы.Выгрузить(тзДокументы.НайтиСтроки(Новый Структура("ТипДокумента",стТипДок.ТипДокумента)));
		
		табДокРеестр = ПечатьРеестра(тзРеестр,	стТипДок.ТипДокумента); 
		ТабДок.Вывести(табДокРеестр);
		
	КонецЦикла;
	
	ТабДок.АвтоМасштаб = Истина;
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.КоличествоЭкземпляров = 1;
	

	Возврат ТабДок;
	 
КонецФункции
 

Функция ПечатьРеестра(тзДокументы,ТипДок="ПоступлениеТоваров")Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьОбщийМакет("Реестр");
	
	Область = Макет.ПолучитьОбласть("Заголовок");
	Область.Параметры.ТекДата = ТекущаяДата();
	Область.Параметры.Магазин = ПараметрыСеанса.Подразделение;
	Если ТипДок = "ПоступлениеТоваров" ИЛИ ТипДок = "РеестрПриходов" Тогда
		
		Область.Параметры.Заголовок = "Надходження товарів";  
	ИначеЕсли ТипДок = "PrintPRP" Тогда
		Область.Параметры.Заголовок = "Переміщення товарів - Надходження";  
	ИначеЕсли ТипДок = "Перемещение"  ИЛИ ТипДок = "PrintPR" Тогда	
		Область.Параметры.Заголовок = "Переміщення товарів";
	ИначеЕсли ТипДок = "ВозвратПоставщику" ИЛИ ТипДок = "PrintVP" Тогда	
		Область.Параметры.Заголовок = "Повернення товарів постачальнику";
	ИначеЕсли ТипДок = "Списание" ИЛИ ТипДок = "PrintSP" Тогда	
		Область.Параметры.Заголовок = "Списання товарів"; 
	ИначеЕсли ТипДок = "PrintIN"  Тогда	
		Область.Параметры.Заголовок = "Iнвентаризація";
	
	КонецЕсли;
	
	ТабДок.Вывести(Область);
	 нпп = 0;
	 
	 Если ТипДок = "ПоступлениеТоваров" ИЛИ ТипДок = "РеестрПриходов" ИЛИ ТипДок = "PrintPRP" Тогда
		 Область = Макет.ПолучитьОбласть("ШапкаПТ");
		 ТабДок.Вывести(Область);
		 
		 Область = Макет.ПолучитьОбласть("СтрокаПТ");
		 Для Каждого Стр Из тзДокументы Цикл 
			 нпп = нпп+1;
			 
			 Область.Параметры.нпп = нпп;
			 Область.Параметры.Дата = Стр.Дата;
			 Область.Параметры.Номер = Стр.НомерДокумента;
			 Область.Параметры.Контрагент = Стр.Контрагент;
			 Область.Параметры.ф = ?(Стр.Проведен=1,"+","-")+" " +Стр.Регл;
			 Область.Параметры.КоличествоПринято = Стр.количествоПринято;
			 Область.Параметры.КоличествоПоставщика = Стр.КоличествоПоставщика;
			 
			 
			 ТабДок.Вывести(Область);
			 
		 КонецЦикла;
	 ИначеЕсли   ТипДок = "Перемещение" ИЛИ ТипДок ="ВозвратПоставщику" ИЛИ ТипДок = "PrintVP" ИЛИ ТипДок = "PrintPR" Тогда
		 
		 Область = Макет.ПолучитьОбласть("ШапкаПР");
		 ТабДок.Вывести(Область);
		 
		 Область = Макет.ПолучитьОбласть("СтрокаПР");
		 Для Каждого Стр Из тзДокументы Цикл 
			 нпп = нпп+1;
			 
			 Область.Параметры.нпп = нпп;
			 Область.Параметры.Дата = Стр.Дата;
			 Область.Параметры.Номер = Стр.НомерДокумента;
			 Область.Параметры.Контрагент = Стр.Контрагент;
			 Область.Параметры.Количество = Стр.КоличествоПринято;
			 
			 ТабДок.Вывести(Область);
			 
		 КонецЦикла;
	 ИначеЕсли   ТипДок = "ИнвентаризацияРеестр" ИЛИ ТипДок = "PrintIN" ИЛИ ТипДок = "Списание" ИЛИ ТипДок = "PrintSP" Тогда
		 
		 Область = Макет.ПолучитьОбласть("ШапкаИН");
		 ТабДок.Вывести(Область);
		 
		 Область = Макет.ПолучитьОбласть("СтрокаИН");
		 Для Каждого Стр Из тзДокументы Цикл 
			 нпп = нпп+1;
			 
			 Область.Параметры.нпп = нпп;
			 Область.Параметры.Дата = Стр.Дата;
			 Область.Параметры.Номер = Стр.НомерДокумента;
			 Область.Параметры.ТоварныеГруппы = Стр.Контрагент;
			 Область.Параметры.Сумма = Стр.Сумма;
			 
			 ТабДок.Вывести(Область);
			 
		 КонецЦикла;
		 
	
	 
	 КонецЕсли;
	 Область = Макет.ПолучитьОбласть("ПодвалПТ");
	 Область.Параметры.ДокКоличество = Формат(нпп, "ЧЦ=15");
	 ТабДок.Вывести(Область);
	 
	 ТабДок.АвтоМасштаб = Истина;
	 
	 ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	 ТабДок.КоличествоЭкземпляров = 1;
	 
	Возврат ТабДок;
	

КонецФункции
